Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: =head2 Memory Management and String Handling
es: =head2 Administración de memoria y manipulación de cadenas

source: =head2 Merging from a branch via GitHub
es: =head2 Combinar desde una rama a través de GitHub

source: =head2 Method Call Variations X<method>
es: =head2 Variantes en las llamadas a los métodos X<method> X<método>

source: =head2 Method Invocation X<invocation> X<method> X<arrow> X<< -> >>
es: =head2 Invocación de métodos X<invocation> X<invocación> X<method> X<método> X<arrow> X<flecha> X<< -> >>

source: =head2 Methods
es: =head2 Métodos

source: =head2 Miscellaneous
es: =head2 Varios

source: =head2 Miscellaneous functions
es: =head2 Funciones varias

source: =head2 Modifiers
es: =head2 Modificadores

source: =head2 Multi-dimensional array emulation
es: =head2 Emulación de matrices multidimensionales

source: =head2 Non-Hash Objects
es: =head2 Objetos no basados en hash

source: =head2 OO Perl
es: =head2 Perl orientado a objetos

source: =head2 OO System Summary
es: =head2 Resumen de sistemas de orientación a objetos

source: =head2 Object
es: =head2 Objeto

source: =head2 OpenBSD core dumps from getprotobyname_r and getservbyname_r with ithreads
es: =head2 OpenBSD vuelca la memoria de trabajo desde getprotobyname_r y getservbyname_r con ithreads

source: =head2 Other OO Systems
es: =head2 Otros sistemas de orientación a objetos

source: =head2 Other interesting, non-Perl books
es: =head2 Otros libros interesantes (no específicos de Perl)

source: =head2 Overview
es: =head2 Introducción

source: =head2 PCRE/Python Support
es: =head2 Compatibilidad con PCRE/Python

source: =head2 PREAMBLE
es: =head2 PREÁMBULO

source: =head2 PUMPKIN?
es: =head2 ¿CALABAZA?

source: =head2 Packages X<package> X<namespace> X<variable, global> X<global variable> X<global>
es: =head2 Paquetes X<package> X<paquete> X<namespace> X<espacio de nombres> X<variable, global> X<global, variable> X<global variable> X<variable global> X<global>

source: =head2 Patch workflow
es: =head2 Flujo de trabajo con parches

source: =head2 Perl Books
es: =head2 Libros sobre Perl

source: =head2 Perl Classes X<class> X<@ISA>
es: =head2 Clases en Perl X<class> X<clase> X<@ISA>

source: =head2 Perl Modules X<module>
es: =head2 Módulos Perl X<module> X<módulo>

source: =head2 Perl variable types
es: =head2 Tipos de variables de Perl

source: =head2 Platform-Specific
es: =head2 Información específica de plataformas

source: =head2 Polymorphism
es: =head2 Polimorfismo

source: =head2 Pseudo-hashes
es: =head2 Seudohashes

source: =head2 Quoting metacharacters
es: =head2 Escape de metacaracteres

source: =head2 Reference Manual
es: =head2 Manual de referencia

source: =head2 References
es: =head2 Referencias

source: =head2 Regular Expressions
es: =head2 Expresiones regulares

source: =head2 Regular expressions
es: =head2 Expresiones regulares

source: =head2 Removed features
es: =head2 Funcionalidades suprimidas

source: =head2 Repeated Patterns Matching a Zero-length Substring
es: =head2 Patrones repetidos que coinciden con subcadenas de longitud cero

source: =head2 Running Perl programs
es: =head2 Ejecución de programas Perl

source: =head2 SELECTED PATCH SIZES
es: =head2 TAMAÑOS DE PARCHE SIGNIFICATIVOS

source: =head2 SELECTED RELEASE SIZES
es: =head2 TAMAÑOS DE VERSIÓN SIGNIFICATIVOS

source: =head2 Safety net
es: =head2 Red de seguridad

source: =head2 Scalar value constructors X<scalar, literal> X<scalar, constant>
es: =head2 Constructores de valores escalares X<scalar, literal> X<scalar, constant> X<escalar, literal> X<escalar, constante>

source: =head2 Scalar values X<scalar> X<number> X<string> X<reference>
es: =head2 Valores escalares X<scalar> X<number> X<string> X<reference> X<escalar> X<número> X<cadena> X<referencia>

source: =head2 Slices X<slice> X<array, slice> X<hash, slice>
es: =head2 Porciones X<slice> X<array, slice> X<hash, slice> X<porción> X<array, porción> X<hash, porción>

source: =head2 Special Backtracking Control Verbs
es: =head2 Verbos especiales para el control de la vuelta atrás

source: =head2 Special Topics
es: =head2 Temas especiales

source: =head2 Step-by-step: Distributing your module
es: =head2 Paso a paso: distribuir el módulo

source: =head2 Step-by-step: Making the module
es: =head2 Paso a paso: crear el módulo

source: =head2 Step-by-step: Preparing the ground
es: =head2 Paso a paso: hacer los preparativos

source: =head2 Submit
es: =head2 Enviar

source: =head2 Subscripts
es: =head2 Subíndices

source: =head2 Symbol Tables X<symbol table> X<stash> X<%::> X<%main::> X<typeglob> X<glob> X<alias>
es: =head2 Tabla de símbolos X<symbol table> X<tabla de símbolos> X<stash> X<%::> X<%main::> X<typeglob> X<glob> X<alias>

source: =head2 Task-Oriented
es: =head2 Libros orientados a tareas específicas

source: =head2 Testing the patch
es: =head2 Comprobar el parche

source: =head2 Tests
es: =head2 Pruebas

source: =head2 The Filter
es: =head2 El filtro

source: =head2 The UNIVERSAL Class X<UNIVERSAL>
es: =head2 La clase UNIVERSAL X<UNIVERSAL>

source: =head2 The most popular books
es: =head2 Los libros más populares

source: =head2 The sheet
es: =head2 La hoja

source: =head2 Tutorials
es: =head2 Tutoriales

source: =head2 Typeglobs and Filehandles X<typeglob> X<filehandle> X<*>
es: =head2 Typeglobs e identificadores de archivo X<typeglob> X<filehandle> X<*> X<identificador de archivo>

source: =head2 User Groups
es: =head2 Grupos de usuarios

source: =head2 Using Perl modules
es: =head2 Utilización de módulos de Perl

source: =head2 Using git to send patch emails
es: =head2 Usar git para enviar parches por correo electrónico

source: =head2 Variable names X<variable, name> X<variable name> X<data type> X<type>
es: =head2 Nombres de variables X<variable, name> X<variable name> X<data type> X<type> X<variable, nombre> X<nombre de variable> X<tipo de datos> X<tipo>

source: =head2 Variable scoping
es: =head2 Ámbito de las variables

source: =head2 Version 8 Regular Expressions X<regular expression, version 8> X<regex, version 8> X<regexp, version 8>
es: =head2 Expresiones regulares versión 8 X<regular expression, version 8> X<regex, version 8> X<regexp, version 8> X<expresión regular, versión 8> X<regex, versión 8> X<regexp, versión 8>

source: =head2 Warning
es: =head2 Advertencia

source: =head2 Warning on \1 Instead of $1
es: =head2 Advertencia sobre \1 en lugar de $1

source: =head2 Websites
es: =head2 Sitios web

source: =head2 What about binary data, like images?
es: =head2 ¿Qué pasa con los datos binarios, como las imágenes?

source: =head2 What about the C<use bytes> pragma?
es: =head2 ¿Y el pragma C<use bytes>?

source: =head2 What about the C<use encoding> pragma?
es: =head2 ¿Y el pragma C<use encoding>?

source: =head2 What are C and C?
es: =head2 ¿Para qué sirven C y C?

source: =head2 What are Perl 4, Perl 5, or Perl 6?
es: =head2 ¿Qué son Perl 4, Perl 5 y Perl 6?

source: =head2 What character encodings does Perl support?
es: =head2 ¿Qué codificaciones de caracteres admite Perl?

source: =head2 What if I don't decode?
es: =head2 ¿Qué pasa si no descodifico?

source: =head2 What if I don't encode?
es: =head2 ¿Qué pasa si no codifico?

source: =head2 What if I don't know which encoding was used?
es: =head2 ¿Y si no sé qué codificación se utilizó?

source: =head2 What is "the UTF8 flag"?
es: =head2 ¿Qué es la "marca UTF8"?

source: =head2 What is Perl 6?
es: =head2 ¿Qué es Perl 6?

source: =head2 What is Perl?
es: =head2 ¿Qué es Perl?

source: =head2 What is a "wide character"?
es: =head2 ¿Qué es un "carácter ancho"?

source: =head2 What is a JAPH?
es: =head2 ¿Qué es un JAPH?

source: =head2 What is perl.com?
es: =head2 ¿Qué es perl.com?

source: =head2 What is the difference between C<:encoding> and C?
es: =head2 ¿En qué se diferencian C<:encoding> y C?

source: =head2 What machines support Perl?
es: =head2 ¿Qué equipos son compatibles con Perl?

source: =head2 What mailing lists are there for Perl?
es: =head2 ¿Qué listas de correo sobre Perl existen?

source: =head2 What modules and extensions are available for Perl?
es: =head2 ¿Qué módulos y extensiones están disponibles para Perl?

source: =head2 What should I make into a module?
es: =head2 ¿Qué se debe incluir en un módulo?

source: =head2 What was Ponie?
es: =head2 ¿Qué es Ponie?

source: =head2 What's the difference between "perl" and "Perl"?
es: =head2 ¿Cuál es la diferencia entre "perl" y "Perl"?

source: =head2 What's the difference between C and C?
es: =head2 ¿Cuál es la diferencia entre C y C?

source: =head2 When should I decode or encode?
es: =head2 ¿Cuándo debo descodificar o codificar?

source: =head2 When shouldn't I program in Perl?
es: =head2 ¿Cuándo no debo elegir Perl?

source: =head2 When to Use OO
es: =head2 Cuándo se debe usar la orientación a objetos

source: =head2 Where can I buy a commercial version of Perl?
es: =head2 ¿Dónde puedo adquirir una versión comercial de perl?

source: =head2 Where can I get a list of Larry Wall witticisms?
es: =head2 ¿Dónde puedo obtener una lista de citas ingeniosas de Larry Wall?

source: =head2 Where can I get information on Perl?
es: =head2 ¿Dónde puedo obtener información sobre Perl?

source: =head2 Where can I post questions?
es: =head2 ¿Dónde puedo publicar preguntas?

source: =head2 Where do I send bug reports?
es: =head2 ¿A qué dirección debo enviar los informes de error?

source: =head2 Where to Find the Community
es: =head2 Cómo entrar en contacto con la comunidad

source: =head2 Which Perl blogs should I read?
es: =head2 ¿Qué blogs sobre Perl debo seguir?

source: =head2 Which magazines have Perl content?
es: =head2 ¿En qué revistas puedo encontrar artículos sobre Perl?

source: =head2 Which version of Perl should I use?
es: =head2 ¿Qué versión de Perl debo utilizar?

source: =head2 Which version of perl should I use?
es: =head2 ¿Qué versión de Perl debo utilizar?

source: =head2 Who supports Perl?
es: =head2 ¿Quién respalda a Perl?

source: =head2 Why do regex character classes sometimes match only in the ASCII range?
es: =head2 ¿Por qué algunas veces las clases de caracteres de expresiones regulares solo detectan caracteres ASCII?

source: =head2 Why do some characters not uppercase or lowercase correctly?
es: =head2 ¿Por qué algunos caracteres no se convierten a mayúsculas o minúsculas correctamente?

source: =head2 Workshops
es: =head2 Talleres

source: =head2 Writing Constructors X<constructor>
es: =head2 Implementación de constructores X<constructor>

source: =head2 Writing subroutines
es: =head2 Programación de subrutinas

source: =head2 Writing the patch
es: =head2 Escribir el parche

source: =head2 Your new toolkit
es: =head2 Su nuevo kit de herramientas

source: =head2 perlunitut isn't really a Unicode tutorial, is it?
es: =head2 En realidad, perlunitut no es un tutorial de Unicode, ¿verdad?

source: =head3 Array Interpolation X<array, interpolation> X<interpolation, array> X<$">
es: =head3 Interpolación de arrays X<array, interpolation> X<interpolation, array> X<$"> X<array, interpolación> X<interpolación, array>

source: =head3 Assertions
es: =head3 Aserciones

source: =head3 Barewords X<bareword>
es: =head3 Palabras sueltas X<palabra suelta>

source: =head3 Binary strings (byte strings)
es: =head3 Cadenas binarias (cadenas de bytes)

source: =head3 Blessing
es: =head3 Bendición

source: =head3 Capture groups
es: =head3 Grupos de captura

source: =head3 Character Classes and other Special Escapes
es: =head3 Clases de caracteres y otros caracteres de escape especiales

source: =head3 Character set modifiers
es: =head3 Modificadores de juego de caracteres

source: =head3 Class Names as Strings
es: =head3 Nombres de clases como cadenas

source: =head3 Decoding
es: =head3 Descodificación

source: =head3 Deferencing Method Call
es: =head3 Desreferencia de llamada a método

source: =head3 Encoding
es: =head3 Codificación

source: =head3 Escape sequences
es: =head3 Secuencias de escape

source: =head3 Forums
es: =head3 Foros

source: =head3 Global Destruction
es: =head3 Destrucción global

source: =head3 How SUPER is Resolved X<SUPER>
es: =head3 Forma de resolución de SUPER X<SUPER>

source: =head3 Indirect Object Syntax X<indirect object>
es: =head3 Sintaxis indirecta de objeto X<indirect object> X<sintaxis indirecta de objeto>

source: =head3 Internal format
es: =head3 Formato interno

source: =head3 Metacharacters
es: =head3 Metacaracteres

source: =head3 Method Calls on Filehandles
es: =head3 Llamadas a métodos en identificadores de archivos

source: =head3 Method Names as Strings
es: =head3 Nombres de métodos como cadenas

source: =head3 Method Resolution Caching
es: =head3 Resolución de métodos con almacenamiento en caché

source: =head3 Method Resolution Order X<method resolution order> X<mro>
es: =head3 Orden de resolución de métodos X<method resolution order> X<orden de resolución de métodos> X<mro>

source: =head3 Multiple Inheritance X<multiple inheritance>
es: =head3 Herencia múltiple X<multiple inheritance> X<herencia múltiple>

source: =head3 News sites
es: =head3 Sitios de noticias

source: =head3 Objects Are Blessed; Variables Are Not
es: =head3 Los objetos están bendecidos; las variables no

source: =head3 On merging and rebasing
es: =head3 Sobre la combinación y la reorganización

source: =head3 Overriding methods and method resolution
es: =head3 Sobrescritura de métodos y resolución de métodos

source: =head3 Quantifiers
es: =head3 Cuantificadores

source: =head3 Special Literals X<special literal> X<__END__> X<__DATA__> X<END> X<DATA> X<end> X<data> X<^D> X<^Z>
es: =head3 Literales especiales X<special literal> X<__END__> X<__DATA__> X<END> X<DATA> X<end> X<data> X<^D> X<^Z> X<literal especial>

source: =head3 Subroutine References as Methods
es: =head3 Referencias a subrutinas como métodos

source: =head3 Text strings (character strings)
es: =head3 Cadenas de texto (cadenas de caracteres)

source: =head3 The patch-free era
es: =head3 Una era sin parches

source: =head3 Version Strings X<version string> X<vstring> X<v-string>
es: =head3 Cadenas de versión X<version string> X<vstring> X<v-string> X<cadena de versión>

source: =head3 Writing Accessors X<accessor>
es: =head3 Implementación de métodos de acceso X<accessor> X<método de acceso>

source: =head4 /a (and /aa)
es: =head4 /a (y /aa)

source: =head4 Character set modifier behavior prior to Perl 5.14
es: =head4 Comportamiento del modificador de juego de caracteres antes de Perl 5.14

source: =head4 Which character set modifier is in effect?
es: =head4 ¿Qué modificador de juego de caracteres está en vigor?

source: =item (<NAME>) ('NAME')
es: =item (<NOMBRE>) ('NOMBRE')

source: =item (?{ CODE })
es: =item (?{ CÓDIGO })

source: =item (R&NAME)
es: =item (R&NOMBRE)

source: =item (none yet identified)
es: =item (aún no se ha identificado ninguna)

source: =item (to be) dropped modules
es: =item módulos quitados (o que se van a quitar)

source: =item * A miniature type system
es: =item * Un sistema de tipos en miniatura

source: =item * Declarative sugar
es: =item * Simplificación declarativa

source: =item * F<Maintainers>, F<Maintainers.pl>, and F<Maintainers.pm>
es: =item * F<Maintainers>, F<Maintainers.pl> y F<Maintainers.pm>

source: =item * Full introspection and manipulation
es: =item * Introspección completa y manipulación

source: =item * Many more features
es: =item * Muchas más características

source: =item * Module tests
es: =item * Pruebas de módulos

source: =item * Rich ecosystem
es: =item * Ecosistema variado

source: =item * Roles built-in
es: =item * Roles predefinidos

source: =item * Self-hosted and extensible
es: =item * Autocontenido y extensible

source: =item 5.005-style threading
es: =item Hilos de ejecución de tipo 5.005

source: =item 64-bit support
es: =item Compatibilidad con 64 bits

source: =item Announce to clpa
es: =item Anuncie el módulo en clpa

source: =item Announce to the modules list
es: =item Anuncie el módulo en la lista de módulos

source: =item Arithmetic
es: =item Aritmética

source: =item Arithmetic operators
es: =item Operadores aritméticos

source: =item Arithmetic operators during C<use integer>
es: =item Operadores aritméticos con C<use integer> activo

source: =item Assertions
es: =item Aserciones

source: =item B<-L> I<language_code>
es: =item B<-L> I<código_idioma>

source: =item B<-M> I<module-name>
es: =item B<-M> I<nombre_módulo>

source: =item B<-d> I<destination-filename>
es: =item B<-d> I<archivo-destino>

source: =item B<-m> I<module>
es: =item B<-m> I<módulo>

source: =item B<-n> I<some-formatter>
es: =item B<-n> I<algún_formateador>

source: =item B<-o> I<output-formatname>
es: =item B<-o> I<formato-salida>

source: =item B<-q> I<perlfaq-search-regexp>
es: =item B<-q> I<regexp-búsqueda-perlfaq>

source: =item B<-w> I<option:value> or B<-w> I<option>
es: =item B<-w> I<opción:valor> o B<-w> I<opción>

source: =item B<BUILD> the module (sometimes unnecessary)
es: =item B<COMPILAR> el módulo (a veces no es necesario)

source: =item B<DECOMPRESS> the file
es: =item B<DESCOMPRIMIR> el archivo

source: =item B<INSTALL> the module.
es: =item B<INSTALAR> el módulo.

source: =item B<PageName|ModuleName|ProgramName|URL>
es: =item B<NombrePágina|NombreMódulo|NombrePrograma|DirecciónURL>

source: =item B<UNPACK> the file into a directory
es: =item B<DESEMPAQUETAR> el archivo en un directorio

source: =item BLOCK
es: =item BLOQUE

source: =item Backtracking control verbs
es: =item Verbos de control de vuelta atrás

source: =item Bitwise operators
es: =item Operadores bit a bit

source: =item Bitwise operators during C<use integer>
es: =item Operadores bit a bit con C<use integer> activo

source: =item Boolean
es: =item booleano

source: =item Boolean context
es: =item contexto booleano

source: =item Boolean logic
es: =item Lógica Booleana

source: =item C preprocessor
es: =item preprocesador de C

source: =item C<(*MARK:NAME)> C<(*:NAME)> X<(*MARK)> X<(*MARK:NAME)> X<(*:NAME)>
es: =item C<(*MARK:NOMBRE)> C<(*:NOMBRE)> X<(*MARK)> X<(*MARK:NAME)> X<(*:NAME)> C<(*MARK:NOMBRE)> C<(*:NOMBRE)>

source: =item C<(*PRUNE)> C<(*PRUNE:NAME)> X<(*PRUNE)> X<(*PRUNE:NAME)>
es: =item C<(*PRUNE)> C<(*PRUNE:NOMBRE)> X<(*PRUNE)> X<(*PRUNE:NAME)> X<(*PRUNE:NOMBRE)>

source: =item C<(*SKIP)> C<(*SKIP:NAME)> X<(*SKIP)>
es: =item C<(*SKIP)> C<(*SKIP:NOMBRE)> X<(*SKIP)>

source: =item C<(*THEN)> C<(*THEN:NAME)>
es: =item C<(*THEN)> C<(*THEN:NOMBRE)>

source: =item C<(?!pattern)> X<(?!)> X<look-ahead, negative> X<lookahead, negative>
es: =item C<(?!patrón)> X<(?!)> X<inspección hacia adelante, negativa>

source: =item C<(?#text)> X<(?#)>
es: =item C<(?#texto)> X<(?#)>

source: =item C<(?&NAME)> X<(?&NAME)>
es: =item C<(?&NOMBRE)> X<(?&NOMBRE)>

source: =item C<(?'NAME'pattern)>
es: =item C<(?'NOMBRE'patrón)>

source: =item C<(?(condition)yes-pattern)>
es: =item C<(?(condición)patrón-sí)>

source: =item C<(?(condition)yes-pattern|no-pattern)>
es: =item C<(?(condición)patrón-sí|patrón-no)>

source: =item C<(?(condition)yes-pattern|no-pattern)> X<(?()>
es: =item C<(?(condición)patrón-sí|patrón-no)> X<(?()>

source: =item C<(?:pattern)> X<(?:)>
es: =item C<(?:patrón)> X<(?:)>

source: =item C<(?<!pattern)> X<(?<!)> X<look-behind, negative> X<lookbehind, negative>
es: =item C<(?<!patrón)> X<(?<!)> X<look-behind, negative> X<lookbehind, negative> X<inspección hacia atrás, negativa>

source: =item C<(?<=pattern)> C<\K> X<(?<=)> X<look-behind, positive> X<lookbehind, positive> X<\K>
es: =item C<(?<=patrón)> C<\K> X<(?<=)> X<look-behind, positive> X<lookbehind, positive> X<inspección hacia atrás, positiva> X<\K>

source: =item C<(?=pattern)> X<(?=)> X<look-ahead, positive> X<lookahead, positive>
es: =item C<(?=patrón)> X<(?=)> X<inspección hacia adelante, positiva>

source: =item C<(??{ code })>
es: =item C<(??{ código })>

source: =item C<(??{ code })> X<(??{})> X<regex, postponed> X<regexp, postponed> X<regular expression, postponed>
es: =item C<(??{ código })> X<(??{})> X<regex, postponed> X<regexp, postponed> X<regular expression, postponed> X<regex, pospuesta> X<regexp, pospuesta> X<expresión regular, pospuesta>

source: =item C<(?PARNO)> C<(?-PARNO)> C<(?+PARNO)> C<(?R)> C<(?0)> X<(?PARNO)> X<(?1)> X<(?R)> X<(?0)> X<(?-1)> X<(?+1)> X<(?-PARNO)> X<(?+PARNO)> X<regex, recursive> X<regexp, recursive> X<regular expression, recursive> X<regex, relative recursion>
es: =item C<(?PARNO)> C<(?-PARNO)> C<(?+PARNO)> C<(?R)> C<(?0)> X<(?PARNO)> X<(?1)> X<(?R)> X<(?0)> X<(?-1)> X<(?+1)> X<(?-PARNO)> X<(?+PARNO)> X<regex, recursive> X<regexp, recursive> X<regular expression, recursive> X<regex, relative recursion> X<regex, recursiva> X<regexp, recursiva> X<expresión regular, recursiva> X<regex, recursión relativa>

source: =item C<(?^aluimsx:pattern)> X<(?^:)>
es: =item C<(?^aluimsx:patrón)> X<(?^:)>

source: =item C<(?adluimsx-imsx:pattern)>
es: =item C<(?adluimsx-imsx:patrón)>

source: =item C<(?{ code })> X<(?{})> X<regex, code in> X<regexp, code in> X<regular expression, code in>
es: =item C<(?{ código })> X<(?{})> X<regex, code in> X<regexp, code in> X<regular expression, code in> X<regex, código interior> X<regexp, código interior> X<expresión regular, código interior>

source: =item C<(?{code})>
es: =item C<(?{código})>

source: =item C<(?|pattern)> X<(?|)> X<Branch reset>
es: =item C<(?|patrón)> X<(?|)> X<Branch reset> X<reinicio de rama>

source: =item C<< (?<NAME>pattern) >> X<< (?<NAME>) >> X<(?'NAME')> X<named capture> X<capture>
es: =item C<< (?<NOMBRE>patrón) >> X<< (?<NAME>) >> X<(?'NAME')> X<named capture> X<capture> X<< (?<NOMBRE>) >> X<(?'NOMBRE')> X<captura con nombre> X<captura>

source: =item C<< (?>pattern) >> X<backtrack> X<backtracking> X<atomic> X<possessive>
es: =item C<< (?>patrón) >> X<backtrack> X<backtracking> X<atomic> X<possessive> X<vuelta atrás> X<volver atrás> X<atómico> X<posesivo>

source: =item C<< (?P=NAME) >>
es: =item C<< (?P=NOMBRE) >>

source: =item C<< (?P>NAME) >>
es: =item C<< (?P>NOMBRE) >>

source: =item C<< (?PE<lt>NAMEE<gt>pattern) >>
es: =item C<< (?PE<lt>NOMBREE<gt>patrón) >>

source: =item C<< \k'NAME' >>
es: =item C<< \k'NOMBRE' >>

source: =item C<< \k<NAME> >>
es: =item C<< \k<NOMBRE> >>

source: =item C<S{REPEAT_COUNT}>
es: =item C<S{CONTADOR_REPETICIÓN}>

source: =item C<S{min,max}>
es: =item C<S{mín,máx}>

source: =item C<S{min,max}?>
es: =item C<S{mín,máx}?>

source: =item C<our> can now have an experimental optional attribute C<unique>
es: =item Atributo opcional experimental C<unique> para C<our>

source: =item Check again
es: =item Compruébelo otra vez

source: =item Check it's new
es: =item Asegúrese de que su contribución es novedosa

source: =item Choose a name
es: =item Elija un nombre

source: =item Code expressions, conditional expressions, and independent expressions in regexes
es: =item Expresiones de código, expresiones condicionales y expresiones independientes en expresiones regulares

source: =item DB module
es: =item Módulo DB

source: =item DOES($role) X<DOES>
es: =item DOES($rol) X<DOES>

source: =item Discuss the need
es: =item Evalúe la necesidad

source: =item Experimental Support for Sun Studio Compilers for Linux OS
es: =item Compatibilidad experimental con compiladores Sun Studio para el sistema operativo Linux

source: =item FAQ
es: =item P+F

source: =item Fix bugs!
es: =item Corrija los errores

source: =item Get a CPAN user ID
es: =item Obtenga un identificador de usuario de CPAN

source: =item GetOpt::Long Options can now take multiple values at once (experimental)
es: =item Capacidad de las opciones de GetOpt::Long para consumir varios valores a la vez (experimental)

source: =item I/O
es: =item E/S

source: =item I<Intermediate Perl> (the "Alpaca Book")
es: =item I<Intermediate Perl> (el "Libro de la Alpaca")
